app/Controllers/DashboardController.php

SELECT COUNT(*) AS `numrows` FROM `karyawan`
SELECT COUNT(*) AS `numrows` FROM `departments`
SELECT COUNT(*) AS `numrows` FROM `jabatan`
SELECT COUNT(*) AS `numrows`
FROM `cuti`
WHERE `status` = 'pending'
---
    public function index()
    {
        $karyawanModel = new KaryawanModel();
        $departmentModel = new DepartmentModel();
        $jabatanModel = new JabatanModel();
        $cutiModel = new CutiModel();

        $data = [
            'title' => 'Dashboard',
            'total_karyawan' => $karyawanModel->countAll(),
            'total_department' => $departmentModel->countAll(),
            'total_jabatan' => $jabatanModel->countAll(),
            'total_cuti_pending' => $cutiModel->where('status', 'pending')->countAllResults(),