app/Controllers/DepartmentController.php

    public function index()
    {
        $data = [
            'title' => 'Data Departemen',
            'departments' => $this->departmentModel->findAll()
---
SELECT *
FROM `departments`