app/Controllers/JabatanController.php

    public function index()
    {
        $data = [
            'title' => 'Data Jabatan',
            'jabatan' => $this->jabatanModel->findAll()
---
SELECT *
FROM `jabatan`