app/Controllers/KaryawanController.php

SELECT *
FROM `departments`
SELECT *
FROM `jabatan`
---
    public function index()
    {
        $data = [
            'title' => 'Data Karyawan',
            'karyawan' => $this->karyawanModel->getKaryawanWithDepartmentAndJabatan(),
            'departments' => $this->departmentModel->findAll(),  // TAMBAHKAN INI
            'jabatan' => $this->jabatanModel->findAll()          // TAMBAHKAN INI

SELECT *
FROM `karyawan`
WHERE `karyawan`.`id` = '4'
SELECT *
FROM `jabatan`
SELECT *
FROM `departments`
---
    public function edit($id)
    {
        $karyawan = $this->karyawanModel->find($id);

        if (!$karyawan) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Karyawan tidak ditemukan');
        }

        $data = [
            'title' => 'Edit Karyawan',
            'karyawan' => $karyawan,
            'departments' => $this->departmentModel->findAll(),
            'jabatan' => $this->jabatanModel->findAll()
        ];

SELECT *
FROM `karyawan`
WHERE `karyawan`.`id` = '4'
---
    public function update($id)
    {
        $karyawan = $this->karyawanModel->find($id);