app/Models/CutiModel.php

    public function getCutiWithKaryawan()
    {
        return $this->select('cuti.*, karyawan.nama as nama_karyawan, departments.nama_departemen')
                    ->join('karyawan', 'karyawan.id = cuti.karyawan_id')
                    ->join('departments', 'departments.id = karyawan.department_id')
                    ->orderBy('cuti.created_at', 'DESC')
                    ->findAll();
---
SELECT `cuti`.*, `karyawan`.`nama` as `nama_karyawan`, `departments`.`nama_departemen`
FROM `cuti`
JOIN `karyawan` ON `karyawan`.`id` = `cuti`.`karyawan_id`
JOIN `departments` ON `departments`.`id` = `karyawan`.`department_id`
ORDER BY `cuti`.`created_at` DESC