app/Models/KaryawanModel.php

    public function getKaryawanWithDepartmentAndJabatan()
    {
        return $this->select('karyawan.*, departments.nama_departemen, jabatan.nama_jabatan')
                    ->join('departments', 'departments.id = karyawan.department_id')
                    ->join('jabatan', 'jabatan.id = karyawan.jabatan_id')
                    ->findAll();
---
SELECT `karyawan`.*, `departments`.`nama_departemen`, `jabatan`.`nama_jabatan`
FROM `karyawan`
JOIN `departments` ON `departments`.`id` = `karyawan`.`department_id`
JOIN `jabatan` ON `jabatan`.`id` = `karyawan`.`jabatan_id`

    public function getKaryawanById($id)
    {
        return $this->select('karyawan.*, departments.nama_departemen, jabatan.nama_jabatan')
                    ->join('departments', 'departments.id = karyawan.department_id')
                    ->join('jabatan', 'jabatan.id = karyawan.jabatan_id')
                    ->find($id);
---
SELECT `karyawan`.*, `departments`.`nama_departemen`, `jabatan`.`nama_jabatan`
FROM `karyawan`
JOIN `departments` ON `departments`.`id` = `karyawan`.`department_id`
JOIN `jabatan` ON `jabatan`.`id` = `karyawan`.`jabatan_id`
WHERE `karyawan`.`id` = '4'

    public function update($id = null, $data = null): bool
    {
        // Skip validation untuk update jika tidak ada data yang berubah
        if (empty($data)) {
            return false;
        }

        // Cek apakah ada perubahan data
        $existingData = $this->find($id);
        if (!$existingData) {
            return false;
        }

        // Bandingkan data lama dengan data baru
        $hasChanges = false;
        foreach ($data as $key => $value) {
            if (isset($existingData[$key]) && $existingData[$key] != $value) {
                $hasChanges = true;
                break;
            }
        }

        // Jika tidak ada perubahan, return true (dianggap berhasil)
        if (!$hasChanges) {
            return true;
        }

        // Lakukan update normal
        return parent::update($id, $data);
---
SELECT *
FROM `karyawan`
WHERE `karyawan`.`id` = '4'
UPDATE `karyawan` SET `nama` = 'HANIF DWINANDA NAUFAL', `email` = 'luthfi.rafanandanaufal@gmail.com', `department_id` = '1', `jabatan_id` = '1', `tanggal_masuk` = '1998-01-02', `status` = 'active', `alamat` = 'VILLA BEKASI INDAH 2 BLOK E 8/31', `telepon` = '08978361911', `foto` = '1754298659_cd6c82d1da3220ee75fa.png', `updated_at` = '2025-08-04 09:10:59'
WHERE `karyawan`.`id` IN ('4')