app/Models/KaryawanModel.php

SELECT `karyawan`.*, `departments`.`nama_departemen`, `jabatan`.`nama_jabatan`
FROM `karyawan`
JOIN `departments` ON `departments`.`id` = `karyawan`.`department_id`
JOIN `jabatan` ON `jabatan`.`id` = `karyawan`.`jabatan_id`
---
    public function getKaryawanWithDepartmentAndJabatan()
    {
        return $this->select('karyawan.*, departments.nama_departemen, jabatan.nama_jabatan')
                    ->join('departments', 'departments.id = karyawan.department_id')
                    ->join('jabatan', 'jabatan.id = karyawan.jabatan_id')
                    ->findAll();